workspace_go/services/assets/docs/benchmarks/results/20260225-180610/test-list-assets-cpu16-hey.txt

Summary:
  Total:	959.0146 secs
  Slowest:	0.4274 secs
  Fastest:	0.0031 secs
  Average:	0.1917 secs
  Requests/sec:	1042.7370
  
  Total data:	10320000000 bytes
  Size/request:	10320 bytes

Response time histogram:
  0.003 [1]	|
  0.046 [146]	|
  0.088 [97]	|
  0.130 [562]	|
  0.173 [181587]	|■■■■■■■■■■
  0.215 [703450]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.258 [75467]	|■■■■
  0.300 [7277]	|
  0.343 [26405]	|■■
  0.385 [4975]	|
  0.427 [33]	|


Latency distribution:
  10%% in 0.1678 secs
  25%% in 0.1759 secs
  50%% in 0.1848 secs
  75%% in 0.1970 secs
  90%% in 0.2181 secs
  95%% in 0.2337 secs
  99%% in 0.3331 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0000 secs, 0.0000 secs, 0.0034 secs
  DNS-lookup:	0.0000 secs, 0.0000 secs, 0.0004 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0153 secs
  resp wait:	0.1916 secs, 0.0031 secs, 0.4274 secs
  resp read:	0.0000 secs, 0.0000 secs, 0.0300 secs

Status code distribution:
  [200]	1000000 responses