workspace_go/services/assets/docs/benchmarks/results/20260225-180610/test-list-assets-cpu4-hey.txt

Summary:
  Total:	941.3378 secs
  Slowest:	0.4007 secs
  Fastest:	0.0024 secs
  Average:	0.1882 secs
  Requests/sec:	1062.3179
  
  Total data:	10320000000 bytes
  Size/request:	10320 bytes

Response time histogram:
  0.002 [1]	|
  0.042 [139]	|
  0.082 [159]	|
  0.122 [358]	|
  0.162 [58578]	|■■■
  0.202 [775674]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.241 [126169]	|■■■■■■■
  0.281 [4739]	|
  0.321 [23616]	|■
  0.361 [10449]	|■
  0.401 [118]	|


Latency distribution:
  10%% in 0.1655 secs
  25%% in 0.1734 secs
  50%% in 0.1821 secs
  75%% in 0.1934 secs
  90%% in 0.2124 secs
  95%% in 0.2271 secs
  99%% in 0.3219 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0000 secs, 0.0000 secs, 0.0056 secs
  DNS-lookup:	0.0000 secs, 0.0000 secs, 0.0037 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0165 secs
  resp wait:	0.1881 secs, 0.0024 secs, 0.4007 secs
  resp read:	0.0000 secs, 0.0000 secs, 0.0316 secs

Status code distribution:
  [200]	1000000 responses