workspace_go/services/assets/docs/benchmarks/results/20260225-180610/test-list-assets-cpu8-hey.txt

Summary:
  Total:	950.3347 secs
  Slowest:	0.4448 secs
  Fastest:	0.0027 secs
  Average:	0.1900 secs
  Requests/sec:	1052.2608
  
  Total data:	10320000000 bytes
  Size/request:	10320 bytes

Response time histogram:
  0.003 [1]	|
  0.047 [133]	|
  0.091 [200]	|
  0.135 [1186]	|
  0.180 [391494]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.224 [540264]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.268 [29419]	|■■
  0.312 [13685]	|■
  0.356 [22792]	|■■
  0.401 [737]	|
  0.445 [89]	|


Latency distribution:
  10%% in 0.1670 secs
  25%% in 0.1746 secs
  50%% in 0.1831 secs
  75%% in 0.1948 secs
  90%% in 0.2159 secs
  95%% in 0.2308 secs
  99%% in 0.3298 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0000 secs, 0.0000 secs, 0.0097 secs
  DNS-lookup:	0.0000 secs, 0.0000 secs, 0.0024 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0158 secs
  resp wait:	0.1899 secs, 0.0027 secs, 0.4448 secs
  resp read:	0.0000 secs, 0.0000 secs, 0.0215 secs

Status code distribution:
  [200]	1000000 responses